---
kind: field
id: F:Autodesk.Revit.DB.PointClouds.CloudPoint.X
source: html/6557467c-17cd-cd31-0b6a-4e3bb12f1fc9.htm
---
# Autodesk.Revit.DB.PointClouds.CloudPoint.X Field

The X coordinate

## Syntax (C#)
```csharp
public float X
```